import { EventData } from "~/util/interface/EventData";

export const map0story: EventData = {
    mapId: "map1",
    endsAt: 1,
    playerMovement: [],
    textData: [
        { text: "먼 옛날, 아름드리라는 나라가 있었습니다." },
        { text: "하지만 사람들에게 이 나라는 이름보다는 마법 나라라는 별명으로 더 자주 불렸지요." },
        { text: "여느 나라와 마찬가지로, 아름드리에는 왕이 있었어요." },
        { text: "하지만 마법 나라가 마법 나라라고 불리는 이유는 따로 있었어요. 바로 마법 나라의 왕이 강력한 마법사였기 떄문이였지요." },
        { text: "그는 마법사이면서 왕이었고, 왕이었으며 마법사였어요." },
        { text: "마법사로서 그는, 나라에 위기가 닥칠 때마다 마법으로 그 위기를 헤쳐 나갔어요." },
        { text: "또 왕으로서 그는, 선대 왕들의 지혜를 빌려 슬기롭게 나라를 통치했습니다." },
        { text: "그는 왕으로서, 그리고 마법사로서 마법 나라를 지켰어요." },
        { text: "하지만 이런 구분은 딱히 의미가 없을 거예요. 그는 마법사였으며 왕이었고, 왕이었으며 마법사였으니까요." },
        { text: "하지만 어느날 갑자기, 마법사 왕은 흔적도 없이 사라져 버렸습니다." },
        { text: "마법사가 사라지자 아름드리는 더 이상 마법 나라가 아니게 되었습니다. 그냥 나라가 되었죠." },
        { text: "그런데 왕 또한 사라졌기에, 아름드리는 이제 나라조차도 아니게 되었지요." },
        { text: "사람들이 왕이 사라진 것을 눈치채기까지는 오랜 시간이 걸리지 않았어요. 곧 사람들은 왕을 찾아 헤매기 시작했죠." },
        { text: "처음에는 왕이 습격을 당한 것이라 걱정하는 사람들도 있었지만, 그럴 리는 없었어요." },
        { text: "왕 그 자신을 제외하면 아름드리의 누구도 왕을 해칠 수는 없었으니까요" },
        { text: "하지만 왕이 늘 있던 왕궁 어디에서도 왕은 찾아볼 수 없었어요." },
        { text: "또 큰 문제도 하나 있었어요. 왕의 얼굴을 기억하는 사람이 아무도 없었다는 것이었죠." },
        { text: "사람들은 이것이 마법사 왕의 마법 때문일 거라고 생각했어요." },
        { text: "역대 왕들의 초상화가 걸려 있는 왕궁의 회랑에서도 현재 왕의 초상화만은 찾아볼 수 없었습니다." },
        { text: "이번 대 왕의 초상화가 있어야 하는 곳에는 누군가가 억지로 뜯어낸 것 같은 자국만이 남아있었지요." },
        { text: "그래도 왕을 찾으려는 사람들은 멈추지 않았어요." },
        { text: "하지만 며칠이나 찾아도 왕이 나타나지 않자, 결국 사람들은 하나둘씩 왕을 찾는 걸 포기하고 각자 집으로 돌아갔지요." },
        { text: "여러 정황으로 미루어 볼 때, 왕은 스스로 사라진 것이 분명했습니다. 그렇다면 왕이 돌아올 때까지 기다리는 수밖에는 없었죠." }
    ],
    mapChange: [],
    creatures: [],
    warps: {
        mapId: "map17",
        playerInitLoc: { mapX: 4, mapY: 4 },
        playerInitAnim: "frontIdle"
    }
} 