import { EventData } from "~/util/interface/EventData";

export const map18story: EventData = {
    mapId: "map18",
    endsAt: 1,
    playerMovement: [],
    textData: [
        { text: "그런데 몇 계단 오르지 않아, 아이는 무언가 이상한 것을 깨달을 수 있었어요." },
        { text: "계단을 오를 때마다 밟고 있던 계단이 사라져갔던 것이었죠." },
        { text: "마법사의 탑이 괜히 마법사의 탑이라고 불리는 것은 아니었어요." },
        { text: "일반적으로 마법은, 사용한 마법사의 역량이 얼마나 뛰어나든 상관없이, 마법사가 계속해서 유지해 주지 않으면 금방 사라져 버려요." },
        { text: "밖에서 본 마법 등불과 마법 생물들이 빛을 잃은 이유도 그래서였죠." },
        { text: "하지만 이곳 마법사의 탑에서만은 예외였어요." },
        { text: "이곳에서는 마법사가 개입해 주지 않아도, 탑을 매개로 마법이 지속되도록 할 수 있었죠." },
        { text: "마법사들은 보통 이를 탑에 마법을 '새긴다'라고 표현했어요." },
        { text: "마법이 새겨질 때 탑 안에 있던 사람의 경우에는 마법이 제대로 적용되지 않는 문제가 있다고는 하지만," },
        { text: "그럼에도 탑의 이런 능력이 신비한 것임은 틀림없었어요." },
        { text: "어찌되었든 간에, 지금이라면 아직 뛰어서 내려갈 수 있겠지만, 계단을 더 오르게 되면 다시 내려가는 건 어려워질 것처럼 보였어요" },
        { text: "아이는 어떻게 해야 할지 고민했어요." }
    ],
    mapChange: [],
    creatures: []
};
