import { EventData } from "~/util/interface/EventData";

export const map10story: EventData = {
    mapId: "map10",
    endsAt: 1,
    playerMovement: [],
    textData: [
        { text: "아이는 목소리를 따라 왕성을 나섰어요." },
        { text: "아까 밤이라고 했었지요? 그런데 사실 그렇게 늦은 시간은 아니었어요." },
        { text: "하지만 바깥은 벌써 한밤중이라고 해도 믿을 정도로 어두컴컴했습니다" },
        { text: "이 또한 왕의 실종과 동시에 일어난 이상한 일들 중 하나였는데, 바로 낮의 길이가 점점 짧아지기 시작했다는 것이었지요." },
        { text: "어느새 하루 중 해가 떠 있는 시간이 해가 져 있는 시간의 절반도 안 될 정도였어요" },
        { text: "이 목소리가 정말로 왕의 목소리라면 아이는 묻고 싶은 게 많았어요." },
        { text: "왕은 어째서 사라진 걸까요?\n낮이 사라진 것도 왕의 마법에 의한 걸까요?\n그리고 어째서 이렇게 마법으로만 말하고 있는" },
        { text: "걸까요?\n왕은 자신을 찾아주기를 바라는 걸까요?" },
        { text: "하지만 그 목소리가 슬프게 들렸기에, 아이는 질문들을 입 밖으로 내지는 않았어요." },
        { text: "목소리가 왕에게 가는 길을 알려준다면, 질문들은 왕을 만난 뒤에 해도 괜찮으리라고 생각했죠." }
    ],
    mapChange: [],
    creatures: []
}