import { EventData } from "~/util/interface/EventData";

export const map24story: EventData = {
    mapId: "map24",
    endsAt: 5,
    playerMovement: [
        { type: "cnst", dir: { mapX: 0, mapY: 1 }, dur: { start: 0, end: 3 } }
    ],
    textData: [
        {
            text: "왕은 힘겨운 몸을 이끌고 마탑을 나섰어요.",
            limits: 0
        },
        {
            text: "감히 왕의 이름을 참칭했으며 아름드리의 낮을 앗아가려 한 죄인, 마왕을 처치하고 오는 길이었죠.",
            limits: 0
        },
        {
            text: "비록 아무도 왕을 해칠 수 없다지만, 그런 왕에게도 마왕과의 전투는 힘겨웠던 것 같아요.",
            limits: 0
        },
        {
            text: "하지만 결국 마왕은 죽었고, 아름드리의 낮은 돌아왔어요.",
            limits: 0
        },
        {
            text: "그 순간, 왕은 뺨을 타고 흘러내리는 눈물을 발견했어요.",
            limits: 0
        },
        {
            text: "하지만 슬플 이유가 없었기에, 왕은 어째서 자신이 눈물을 흘리고 있는지 이해할 수 없었어요.",
            limits: 0,
        },
        {
            text: '"하하... 하..."',
            limits: 1
        },
        {
            text: "왕은 스스로를 속이는 짓은 그만두기로 했어요.",
            limits: 1
        },
        {
            text: "마법사가 왕에게 친구를 죽였다는 기억을 남겨주고 싶지는 않았을 거예요.",
            limits: 2
        },
        {
            text: "그럼에도 그를 불러 자신을 죽이게 한 이유는 그녀 역시 왕이었기 때문이었습니다.",
            limits: 2,
        },
        {
            text: "왕 자신을 제외하면 아름드리의 누구도 왕을 해칠 수 없다.",
            limits: 2,
        },
        {
            text: "이 법칙은 어떤 마법으로도 깰 수 없는 절대적인 법칙이었어요.",
            limits: 2,
        },
        {
            text: "마법으로 왕인 척할 수는 있을지라도, 왕을 죽일 수 있는 것이 그 뿐이라는 사실을 바꿀 수는 없었지요.",
            limits: 2
        },
        {
            text: "하지만 그럼에도 마법사는 왕이 괴로워하지 않았으면 했어요. 그래서 그녀는 스스로 악역을 자처했습니다.",
            limits: 2
        },
        {
            text: "그래서 그녀는 죽음의 순간 그녀의 가장 강력한 마법을 탑에 새겨, 마왕으로서, 죄인으로서 죽었습니다.",
            limits: 2
        },
        {
            text: "하지만 그 마법이 새겨질 때, 왕은 아직 탑 안에 있었어요. 그래서 그는 그 마법의 영향을 받지 않았습니다.",
            limits: 2
        },
        {
            text: "하지만 탑 안에 있다는 것도 애매했기 때문에, 원했다면 얼마든지 진실을 잊을 수도 있었을 거예요.",
            limits: 2
        },
        {
            text: "하지만 왕은 그러지 않기로 했어요.",
            limits: 2,
        },
        {
            text: "너무나도 슬펐지만, 그래도 왕은 도망치지 않기로 했어요. 마법사의 희생을 잊지 않기로 했어요.",
            limits: 2
        },
        {
            text: "왕은 눈물을 닦고는 성으로 발걸음을 옮겼어요.",
            appearsAt: 2,
            limits: 3
        },
        {
            text: "하늘 높이 떠 있는 해가 밝게 빛나며 왕을 반겼습니다.",
            appearsAt: 2,
            limits: 3,
        },
    ],
    mapChange: [],
    creatures: [],
    end: "TrueEnd"
};