import { EventData } from "~/util/interface/EventData";

export const map20story: EventData = {
    mapId: "map20",
    endsAt: 1,
    playerMovement: [],
    textData: [
        { text: "하지만 어떤 마법도 아이를 멈추지는 못했어요. 옷이 불에 그을리고, 넘어지긴 했지만 아이에게는 어떤 부상도 없었지요." },
        { text: "아이는 그것이 왕의 검 덕분이라고 생각했어요." }, 
        { text: "왕 그 자신을 제외하면 아름드리의 누구도 왕을 해칠 수 없다는 말을 기억하시나요?" },
        { text: "그건 아름드리의 누구도 감히 왕에게 해를 끼칠 생각을 하지 못한다는 종류의 말이 아니었어요." },
        { text: "말 그대로, 왕 자신을 제외하고는 아름드리의 누구도, 그리고 무엇도 왕을 해칠 수 없다는 말이지요" },
        { text: "그건 겨울이 되면 눈이 내리고, 봄이 되면 꽃이 피는 것과 같은 일종의 자연 법칙이었어요." },
        { text: "물론 마법이라는 것은 기본적으로 자연 법칙을 거스르는 힘이었어요." },
        { text: "마법은 겨울에 꽃이 피게, 봄에 눈이 내리게 할 수도 있지요." },
        { text: "계절이라는 개념쯤은 간단하게 무의미한 것으로 만들 수 있을 정도로 강력한 것이 마법이었지요." },
        { text: "하지만 마법으로도 부술 수 없는 법칙이 바로 저것이었어요." },
        { text: "그렇기에 어떤 마법도 아름드리의 왕을 해칠 수는 없었지요" },
        { text: "그리고 탑의 마법이 자신을 해치지 못하는 것을 보며, 아이는 이와 비슷한 법칙이 작동하고 있다고 생각했어요." },
        { text: "수많은 왕들의 손을 거쳐온 초대왕의 검에도 비슷한 힘이 깃들었는지 모르는 일이었지요." },
        { text: "아니면 아이와 함께하는 왕의 목소리의 힘일지도요." }
    ],
    mapChange: [],
    creatures: []
};