import { EventData } from "~/util/interface/EventData";

export const map8story: EventData = {
    mapId: "map8",
    endsAt: 1,
    playerMovement: [],
    textData: [
        { text: "아이는 왕성에 길에는 이미 통달해 있었어요. 아마 며칠을 왕을 찾아 헤맸기 때문이겠죠." },
        { text: "아이는 왕성을 구석구석 둘러본 후, 이곳에는 분명 왕이 없다는 결론을 내렸어요." },
        { text: "그런데 그러던 중, 아이는 어디선가 들려오는 목소리를 듣게 되었습니다." },
        { text: "어째서인지, 아이는 그 목소리가 익숙하게 들린다고 생각했어요. 하지만 어디서 들었는지 기억할 수는 없었지요." },
        { text: '목소리는 아이에게 말했어요. "왕을 찾고 있나요?"' },
        { text: "아이는 고개를 끄덕였어요. 그러면서 그는, 이것 또한 왕의 마법일 것이라 생각했어요." },
        { text: "이런 식으로 목소리를 내는 건, 말 그대로 마법 같은 일이잖아요?" },
        { text: "이런 마법을 쓸 수 있는 건, 마법사 왕밖에는 없었으니까요." },
        { text: "목소리는 잠시 침묵하더니, 자신을 따라오라고 손짓했어요." },
        { text: "아이는 목소리가 손짓을 어떻게 할 수 있는지 궁금했지만, " },
        { text: "마법이라는 게 원래 평범한 사람들은 이해할 수 없는 식으로 작동하는 법이잖아요?" },
        { text: "목소리가 멀어져 가는 것이 느껴졌기에, 아이는 더 이상 고민하지 않고 목소리를 따라갔어요." }
    ], 
    mapChange: [],
    creatures: []
}