export default [
    { text: "마법이 없어진 아름드리의 밤은 캄캄했어요", stopTime: true },
    { text: "마법이 사라지지 않았다면 밤이라고 해도 이렇게까지 깜깜하지는 않았을 거예요", stopTime: true },
    { text: "길마다 설치된 마법 등불과 스스로 빛을 내는 마법 생물들이 밤을 밝혔을 테니까요", stopTime: true },
    { text: "하지만 마법이 사라진 지금, 등불들은 더 이상 빛나지 않았고, 마법 생물들은 침묵을 지켰어요", stopTime: true },
    { text: "'침묵을 지켰다'라는 표현은 옳지 않을지도 모르겠네요.", stopTime: true },
    { text: "마법이라는 것은 이들 마법 생물에게는 존재의 근원이었어요. 그런 마법이 사라졌기에, 이들은 극도의 스트레스를 받은 상태였죠", stopTime: true },
    { text: "몇몇은 지쳐 쓰러져 있기도 했지만, 빛을 낼 수 없음에도 충직하게 평소와 같은 길을 순찰하고 있는 것들도 있었어요", stopTime: true },
    { text: "하지만 어느 쪽이든 가까이 다가오는 사람들에게는 그다지 친절하게 반응하지 않았죠", stopTime: true },
    { text: "한치 앞도 보이지 않았지만, 아이는 최선을 다해 난폭해진 마법 생물들을 피하며 목소리를 따라갔어요."}
]